{
    "name": "Amber",
    "title": "Gliding Champion",
    "element": "Pyro",
    "weapon": "Bow",
    "nation": "Mondstadt",
    "affiliation": "Knights of Favonius",
    "rarity": 4,
    "constellation": "Lepus",
    "birthday": "10/08",
    "description": "As the only remaining Outrider of the Knights of Favonius, she is always ready to help the citizens of Mondstadt — whether it be something simple or perhaps a more challenging task.",
    "ascensionStat": "ATK%",
    "skills": [
        {
            "name": "Sharpshooter",
            "type": "normal_attack",
            "description": "Normal Attack: Performs up to 5 consecutive shots with a bow. Charged Attack: Perform a more precise Aimed Shot with increased DMG. While aiming, flames will accumulate on the arrowhead. A fully charged flaming arrow will deal Pyro DMG. Plunging Attack: Fires off a shower of arrows in mid-air before falling and striking the ground, dealing AoE DMG upon impact."
        },
        {
            "name": "Explosive Puppet",
            "type": "elemental_skill",
            "description": "The ever-reliable Baron Bunny takes the stage. Baron Bunny: Continuously taunts the enemy, drawing their fire. Baron Bunny's HP scales with Amber's Max HP. When destroyed or when its timer expires, Baron Bunny explodes, dealing AoE Pyro DMG. Hold: Adjusts the throwing direction of Baron Bunny. The longer the button is held, the further the throw."
        },
        {
            "name": "Fiery Rain",
            "type": "elemental_burst",
            "description": "Fires off a shower of arrows, dealing continuous AoE Pyro DMG."
        }
    ],
    "passives": [
        {
            "name": "Gliding Champion",
            "type": "passive_asc_0",
            "description": "Decreases gliding Stamina consumption for your own party members by 20%. Not stackable with Passive Talents that provide the exact same effects."
        },
        {
            "name": "Every Arrow Finds Its Target",
            "type": "passive_asc_1",
            "description": "Increases the CRIT Rate of Fiery Rain by 10% and widens its AoE by 30%."
        },
        {
            "name": "Precise Shot",
            "type": "passive_asc_4",
            "description": "Aimed Shot hits on weak spots increase ATK by 15% for 10s."
        }
    ],
    "constellations": [
        {
            "name": "One Arrow to Rule Them All",
            "type": "c1",
            "description": "Fires 2 arrows per Aimed Shot. The second arrow deals 20% of the first arrow's DMG. "
        },
        {
            "name": "Bunny Triggered",
            "type": "c2",
            "description": "Baron Bunny, new and improved! Hitting Baron Bunny's foot with a fully-charged Aimed Shot manually detonates it. Explosion via manual detonation deals 200% additional DMG."
        },
        {
            "name": "It Burns!",
            "type": "c3",
            "description": "Increases the Level of Fiery Rain by 3. Maximum upgrade level is 15."
        },
        {
            "name": "It's Not Just Any Doll...",
            "type": "c4",
            "description": "Decreases Explosive Puppet's CD by 20%. Adds 1 additional charge."
        },
        {
            "name": "It's Baron Bunny!",
            "type": "c5",
            "description": "Increases the Level of Explosive Puppet by 3. Maximum upgrade level is 15."
        },
        {
            "name": "Wildfire",
            "type": "c6",
            "description": "Fiery Rain increases all party members' Movement SPD by 15% and ATK by 15% for 10s."
        }
    ],
    "images": {
        "art": "https://static.wikia.nocookie.net/gensin-impact/images/0/02/Amber_Wish.png/revision/latest/scale-to-width-down/1000?cb=20201119223905",
        "card": "https://static.wikia.nocookie.net/gensin-impact/images/f/ff/Amber_Card.png/revision/latest?cb=20220725204839",
        "portrait": "https://static.wikia.nocookie.net/gensin-impact/images/7/75/Amber_Icon.png/revision/latest?cb=20210213161233"
    }
}
